tap "buo/cask-upgrade"
# tap "homebrew/bundle"
# tap "homebrew/cask-fonts"
# tap "homebrew/services"
# tap "homebrew/cask-versions"
tap "hashicorp/tap"
tap "stripe/stripe-cli"

## Terminal experience
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-git-prompt"

# Better versions of Mac built-ins
brew "colordiff"
brew "rsync"
brew "the_silver_searcher"

# General development
brew "git"
brew "git-lfs"
brew "vcprompt"
brew "universal-ctags"
brew "watchman"
brew "postgresql@14"
brew "flyctl"
brew "act"

# Node
brew "node@22"
brew "nvm"

# pyenv
brew "pkg-config"
brew "pipenv"
brew "pyenv"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

# Ruby development
brew "ruby-install"
brew "ruby-build"
brew "rbenv"

# More nice-to-haves and various development libraries
brew "autojump"
brew "httpie"
brew "openssl"
brew "tmate"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "tree"
brew "bat"
brew "pre-commit"
brew "direnv"
brew "gh"
brew "starship"
brew "cloudflared"
brew "caddy"

# tmux copy and paste
brew "reattach-to-user-namespace"

# React native
# brew "cocoapods"

# Apps
brew "neovim"
cask "1password-cli"
cask "warp"

# Fonts
cask "font-hack-nerd-font"
cask "font-fira-code"

# Railway
brew "railway"

# Dequency
tap "bbc/audiowaveform"
brew "audiowaveform"
brew "awscli"
brew "stripe/stripe-cli/stripe"
brew "ffmpeg"
brew "b2-tools"

# Forage
# brew "hashicorp/tap/terraform"
brew "vips"
brew "tfenv"
cask "ngrok"
brew "gnupg"
brew "pinentry-mac"
brew "uv"
brew "mise"
