tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "hashicorp/tap"

## Terminal experience
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-git-prompt"

# Better versions of Mac built-ins
brew "colordiff"
brew "rsync"
brew "the_silver_searcher"

# General development
brew "git"
brew "git-lfs"
brew "vcprompt"
brew "universal-ctags"
brew "watchman"
brew "postgresql@14"
brew "flyctl"

# Node
brew "node@16"
brew "nvm"

# pyenv
brew "pkg-config"
brew "pipenv"
brew "pyenv"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

# Ruby development
brew "ruby-install"

# More nice-to-haves and various development libraries
brew "autojump"
brew "httpie"
brew "openssl"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "bat"
brew "pre-commit"
brew "direnv"
brew "gh"

# tmux copy and paste
brew "reattach-to-user-namespace"

# Apps
cask "openconnect-gui"

# Dequency
tap "bbc/audiowaveform"
brew "audiowaveform"
brew "awscli"
brew "hashicorp/tap/terraform"
