tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "getsentry/tools"
tap "helix-editor/helix"

# Better versions of Mac built-ins
brew "bash"
brew "bash-completion"
brew "colordiff"
# brew "gnu-sed", args: ["with-default-names"]
brew "rsync"
brew "the_silver_searcher"

# General development
tap "universal-ctags/universal-ctags"
brew "git"
brew "git-lfs"
brew "vcprompt"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "watchman"
brew "helix"

# Node
brew "node@12"
brew "node@14"
brew "node@16"

# node-canvas <https://github.com/Automattic/node-canvas>
brew "cairo"
brew "giflib"
brew "jpeg"
brew "libpng"
brew "pango"
brew "pkg-config"

brew "pipenv"

# pyenv
brew "pyenv"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

# Ruby development
brew "ruby-install"


# More nice-to-haves and various development libraries
brew "autojump"
brew "httpie"
brew "mas"
brew "openssl"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "bat"
brew "hub"
brew "pre-commit"
brew "direnv"
brew "hugo"
brew "gh"

# tmux copy and paste
brew "reattach-to-user-namespace"

# Apps
cask "openconnect-gui"
# cask "oktadeveloper/tap/okta"
# cask "docker"
# cask "java8"
# cask "react-native-debugger"
# cask "vagrant"
# cask "vagrant-manager"
